Revit 2027 API
ParameterTypeId.StructConnectionCutback Property
 "Automatic Cutback for Beams and Braces"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructConnectionCutback { get; }
Public Shared ReadOnly Property StructConnectionCutback As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructConnectionCutback {
	ForgeTypeId^ get ();
}
static member StructConnectionCutback : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace